---
kind: method
id: M:Autodesk.Revit.DB.Units.#ctor(Autodesk.Revit.DB.UnitSystem)
source: html/bbb9a083-3c3b-b1b9-dfb3-06e376c118ee.htm
---
# Autodesk.Revit.DB.Units.#ctor Method

Creates a new Units object with default settings for Metric or Imperial units.

## Syntax (C#)
```csharp
public Units(
	UnitSystem unitSystem
)
```

## Parameters
- **unitSystem** (`Autodesk.Revit.DB.UnitSystem`) - Indicates whether the Units object should be initialized with default settings for Metric or Imperial units.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration